[CortanaRifle X2WeaponTemplate]
FriendlyName="硬光步枪"
BriefSummary="凭借对图纸现实和长老等离子武器的了解，现在可以不完全复制其基于"神经物理学"的武器。这种固体全息武器只有在有意识的人工智能的控制下才能可靠地证实，迫使它"关闭"所有类型的机器。"
TacticalText="<Bullet/> 强光炮对普通目标造成的伤害很小，但致命一击伤害非常高。\n<Bullet/>总能保证对机械单位造成致命一击。"
AbilityDescName="硬光步枪"


[SparkRifle_HL X2WeaponTemplate]
FriendlyName="强光炮"
BriefSummary="凭借对图纸现实和长老等离子武器的了解，现在可以不完全复制其基于"神经物理学"的武器。这种固体全息武器只有在有意识的人工智能的控制下才能可靠地证实，迫使它"关闭"所有类型的机器。"
TacticalText="<Bullet/> 强光炮对普通目标造成的伤害很小，但致命一击伤害非常高。\n<Bullet/>总能保证对机械单位造成致命一击。"
AbilityDescName="强光炮"


[SmartAIPCS X2EquipmentTemplate]
FriendlyName="智能AI神经接口"
FriendlyNamePlural="智能AI神经接口"
BriefSummary="这种具有智能 AI 的控制论植入物可减少 -100 黑客攻击，但在激活时可暂时获得 +60 黑客攻击奖励。当该单位被隐藏时，变种人安全塔无法看到它。"

[SmartAIPassive X2AbilityTemplate]
LocFriendlyName="智能人工智能"
LocLongDescription="减少 -100 黑客 变种人安全塔在隐藏时无法看到该单位。"
LocHelpText="减少 -100 黑客 变种人安全塔在隐藏时无法看到该单位。"

[SmartAIOnline X2AbilityTemplate]
LocFriendlyName="激活智能AI"
LocLongDescription="激活后暂时获得 +60 黑客奖励。（消耗该物品）"
LocHelpText="激活后暂时获得 +60 黑客奖励。（消耗该物品）"
